Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder.SetSpec(Autodesk.Revit.DB.ForgeTypeId)
Sets the spec describing the field's values.
specTypeId:
Identifier of the spec.
Returns:
The FieldBuilder object may be used to add more details to the field.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The SchemaBuilder has already finished building the Schema.
-or-
The field type does not utilize unit conversions.
Since:
2012